{
  "movies": [
    {
      "id": 1,
      "name": "Brooklyn",
      "description": "La joven inmigrante irlandesa Eilis Lacey (Saoirse Ronan) navega su camino dentro de los años 50 en la ciudad de Brooklyn. Atraída por la promesa de los Estados Unidos, Eilis se va de Irlanda y la comodidad de su casa materna cerca de las orillas de la ciudad de Nueva York. El shock inicial de la nostalgia disminuye rápidamente con un nuevo romance que lleva a Eilis directo al encanto embriagador del amor. Pero pronto, su nueva vivacidad se ve interrumpida por su pasado, y Eilis debe elegir así entre dos países y las vidas que existen dentro.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "111",
      "director": "John Crowley",
      "cast": "Doug Cox, Jordan Black, Linda Porter, Paul Reubens",
      "imgroute": "1.jpg",
      "rank": null
    },
    {
      "id": 2,
      "name": "Exposed",
      "description": "Después de ser testigo de un milagro, una joven latina experimenta cosas extrañas mientras que un detective intenta descubrir la verdad detrás de la muerte de su compañero.",
      "genres": "Crimen | Drama | Misterio",
      "genrecode": "G00000001000000011",
      "year": "2016",
      "duration": "102",
      "director": "Declan Dale",
      "cast": "Ana de Armas, Big Daddy Kane, Christopher McDonald, Mira Sorvino",
      "imgroute": "2.jpg",
      "rank": null
    },
    {
      "id": 3,
      "name": "El renacido",
      "description": "La historia se ambienta en 1820, donde un hombre: Hugo Glass, es dado por muerto luego del ataque de un oso en la frontera y regresa para cobrar venganza sobre quienes lo abandonaron.",
      "genres": "Aventura | Drama | Suspenso",
      "genrecode": "G10000001000001000",
      "year": "2015",
      "duration": "156",
      "director": "Alejandro González Iñárritu",
      "cast": "Domhnall Gleeson, Leonardo DiCaprio, Tom Hardy, Will Poulter",
      "imgroute": "3.jpg",
      "rank": null
    },
    {
      "id": 4,
      "name": "Pee-wee's Big Holiday",
      "description": "Road movie que sigue el fatídico y misterioso encuentro que inspira a Pee-wee para comenzar su primer día de vacaciones. Una historia que se convierte en una situación de amistad, épica y marcada por el destino.",
      "genres": "Aventura | Comedia",
      "genrecode": "G10010000000000000",
      "year": "2016",
      "duration": "89",
      "director": "John Lee",
      "cast": "Doug Cox, Jordan Black, Linda Porter, Paul Reubens",
      "imgroute": "4.jpg",
      "rank": null
    },
    {
      "id": 5,
      "name": "Mojave",
      "description": "Un artista rico y suicida se encuentra frente a un solitario y violento psicótico, al cual el artista casi mata mientras vagaba a través del desierto de Mojave.",
      "genres": "Suspenso",
      "genrecode": "G0000000000001000",
      "year": "2015",
      "duration": "93",
      "director": "William Monahan",
      "cast": "Garrett Hedlund, Mark Wahlberg, Oscar Isaac, Walton Goggins",
      "imgroute": "5.jpg",
      "rank": null
    },
    {
      "id": 6,
      "name": "Mune: Guardian of the Moon",
      "description": "Mune tiene una enorme responsabilidad: para sorpresa de todos, ha sido designado guardián de la luna. Sin embargo, una cadena de accidentes provocados por Mune termina con el guardián de las tinieblas robando el Sol. Con la ayuda de Sohone, el guardián del sol, y de Cire, una frágil criatura, Mune se embarca en una extraordinaria aventura para recuperar el astro.",
      "genres": "Animada",
      "genrecode": "G00100000000000000",
      "year": "2014",
      "duration": "86",
      "director": "Alexandre Heboyan, Benoît Philippon",
      "cast": "Izïa Higelin, Michaël Grégorio, Omar Sy, Shafik Ahmad",
      "imgroute": "6.jpg",
      "rank": null
    },
    {
      "id": 7,
      "name": "Jane Got a Gun",
      "description": "La joven Jane está casada con uno de los tipos más peligrosos del Oeste. Un día su marido regresa a casa con 8 heridas de bala. La banda del cruel Bishop lo ha acribillado. Sobrevive, pero sabe que es cuestión de tiempo que Bishop y sus chicos vengan a rematar la faena. Jane decidirá no esperar a que venga e ir directamente a por ellos. Con la ayuda de un enemigo acérrimo de su marido, un hombre enamorado de ella, Jane irá a enfrentarse la banda de delincuentes.",
      "genres": "Accion | Drama",
      "genrecode": "G0100000100000000",
      "year": "2015",
      "duration": "98",
      "director": "Gavin O'Connor",
      "cast": "Ewan McGregor, Joel Edgerton, Natalie Portman, Rodrigo Santoro",
      "imgroute": "7.jpg",
      "rank": null
    },
    {
      "id": 8,
      "name": "The Benefactor",
      "description": "Un filántropo se entromete en la vida de las parejas de recién casados en un intento por revivir su pasado.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "93",
      "director": "Andrew Renzi",
      "cast": "Cheryl Hines, Dakota Fanning, Richard Gere, Theo James",
      "imgroute": "8.jpg",
      "rank": null
    },
    {
      "id": 9,
      "name": "Hermanas, Sisters",
      "description": "Dos hermanas desconectadas llamadas a casa para limpiar su habitación de la infancia antes de que sus padres vendan la casa familiar. Buscando revivir sus viejos días de gloria, organizan una última fiesta como en sus tiempos de adolescencia para sus compañeros de escuela, que se convierte en el evento catártico de desahogo que un grupo de adultos deprimidos realmente necesita.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2015",
      "duration": "118",
      "director": "Jason Moore",
      "cast": "Amy Poehler, Ike Barinholtz, Maya Rudolph, Tina Fey",
      "imgroute": "9.jpg",
      "rank": null
    },
    {
      "id": 10,
      "name": "Countdown",
      "description": "Ray Fitzpatrick Dolph Ziggler) es un duro polícia de narcóticos que trabaja en Los Ángeles. Después de que una redada de drogas va mal, Ray se ve obligado a matar a su propio compañero, dando lugar a su suspensión como policía. Antes de darse cuenta, Ray se arrastra de nuevo a la investigación cuando un misterioso paquete llega a la estación dirigida a él. El paquete conduce a Ray y a sus colegas a una página web cifrada donde un secuestrador identificado difunde una amenaza para Ray y toda la fuerza policial.",
      "genres": "Accion",
      "genrecode": "G01000000000000000",
      "year": "2016",
      "duration": "90",
      "director": "John Stockwell",
      "cast": "Alexander Kalugin, Glenn Jacobs, Katharine Isabelle, Nick Nemeth",
      "imgroute": "10.jpg",
      "rank": null
    },
    {
      "id": 11,
      "name": "Get a Job",
      "description": "Narra la historia de un recién graduado en la universidad y sus intentos por encontrar un buen trabajo.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2016",
      "duration": "83",
      "director": "Dylan Kidd",
      "cast": "Alison Brie, Anna Kendrick, Bryan Cranston, Miles Teller",
      "imgroute": "11.jpg",
      "rank": null
    },
    {
      "id": 12,
      "name": "Terminus",
      "description": "A raíz de un accidente casi fatal, David Chamberlain hace un descubrimiento sin precedentes que no sólo determinará el destino de su familia, sino de la humanidad.",
      "genres": "Accion",
      "genrecode": "G00000100000000000",
      "year": "2015",
      "duration": "94",
      "director": "Marc Furmie",
      "cast": "Bren Foster, Jai Koutrae, Kendra Appleton, Todd Lasance",
      "imgroute": "12.jpg",
      "rank": null
    },
    {
      "id": 13,
      "name": "El bosque siniestro",
      "description": "Una joven estadounidense va en busca de su hermana  gemela, que ha desaparecido misteriosamente en el bosque Aokigahara,  en la base del Monte Fuji. A pesar de la advertencia de todos de “no  salirse del sendero”, Sara entra al bosque determinada a encontrar la  verdad sobre el destino de su hermana. Se enfrentará a las almas  enojadas y atormentadas de los muertos que asedian a cualquiera que  entra en el bosque.",
      "genres": "Misterio | Terror",
      "genrecode": "G0000000000100010",
      "year": "2016",
      "duration": "90",
      "director": "John Stockwell",
      "cast": "Alexander Kalugin, Glenn Jacobs, Katharine Isabelle, Nick Nemeth",
      "imgroute": "13.jpg",
      "rank": null
    },
    {
      "id": 14,
      "name": "Ip Man 3",
      "description": "Una banda de criminales dirigidos por un constructor ambicioso intentan desalojar la escuela local pero el maestro Ip Man no está dispuesto a ceder. Paralelamente, un nuevo maestro de Wing Chun ha llegado a la ciudad.",
      "genres": "Accion | Drama",
      "genrecode": "G01000001000000000",
      "year": "2015",
      "duration": "105",
      "director": "Wilson Yip",
      "cast": "Donnie Yen, Jin Zhang, Lynn Hung, Mike Tyson",
      "imgroute": "14.jpg",
      "rank": null
    },
    {
      "id": 15,
      "name": "The Division: Agent Origins",
      "description": "Tom Clancy’s The Division: Agent Origins nos cuenta distintas historias, que van desde uno grupo de amigos conspiranoicos aislados durante la enfermedad en su piso, a los problemas y revueltas vistas en una penitenciaría, pasando por las penurias que viven los supervivientes a la enfermedad entre las calles de Nueva York. De una manera u otra, estos cortos están conectados entre sí, destacando de ellos su alto nivel de producción.",
      "genres": "Accion",
      "genrecode": "G01000000000000000",
      "year": "2016",
      "duration": "31",
      "director": "Adrian Picardi, Devin Graham",
      "cast": "Amanda Day, Danny August Mason, Matt Lynch, Sasha Andreev",
      "imgroute": "15.jpg",
      "rank": null
    },
    {
      "id": 16,
      "name": "Justice League vs. Teen Titans",
      "description": "Nueva película de La Liga de la Justicia.",
      "genres": "Accion | Animada",
      "genrecode": "G01100000000000000",
      "year": "2016",
      "duration": "78",
      "director": "Sam Liu",
      "cast": "Jon Bernthal, Rosario Dawson, Shemar Moore, Taissa Farmiga",
      "imgroute": "16.jpg",
      "rank": null
    },
    {
      "id": 17,
      "name": "Orgullo, prejuicio y zombies",
      "description": "El clásico de Jane Austen sobre las relaciones románticas entre personajes de diferentes estratos sociales en la Inglaterra del siglo XIX, se encuentra con un nuevo obstáculo: un ejército de zombies.",
      "genres": "Accion | Romance | Terror",
      "genrecode": "G01000000001100000",
      "year": "2016",
      "duration": "107",
      "director": "Burr Steers",
      "cast": "Bella Heathcote, Ellie Bamber, Lily James, Sam Riley",
      "imgroute": "17.jpg",
      "rank": null
    },
    {
      "id": 18,
      "name": "The Night Before",
      "description": "Tres amigos de toda la vida se reúnen todos los años la víspera de Navidad para vivir una noche de desenfreno. En la que podría ser su última reunión anual, se proponen encontrar el Santo Grial de las fiestas de Navidad.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2015",
      "duration": "101",
      "director": "Jonathan Levine",
      "cast": "Anthony Mackie, Jillian Bell, Joseph Gordon-Levitt, Seth Rogen",
      "imgroute": "18.jpg",
      "rank": null
    },
    {
      "id": 19,
      "name": "Forsaken",
      "description": "Atormentado por un oscuro secreto, un pistolero abandona su vida de asesinatos y regresa a casa, cuando se entera que su madre murió. Él se ve obligado a confrontar a su padre distante y la vida que dejó atrás.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "90",
      "director": "Jon Cassar",
      "cast": "Demi Moore, Donald Sutherland, Kiefer Sutherland, Michael Wincott",
      "imgroute": "19.jpg",
      "rank": null
    },
    {
      "id": 20,
      "name": "Alvin y las ardillas 4",
      "description": "Tras una serie de malentendidos Alvin, Simon y Theodore creen que Dave va a declararse a su nueva novia en Nueva York, y olvidarse de ellos. Tienen tres días para intentar romper el  compromiso y salvarse así de la pérdida de Dave.",
      "genres": "Animada | Aventura | Comedia",
      "genrecode": "G10110000000000000",
      "year": "2015",
      "duration": "92",
      "director": "Walt Becker",
      "cast": "Jason Lee, Jesse McCartney, Justin Long, Matthew Gray Gubler",
      "imgroute": "20.jpg",
      "rank": null
    },
    {
      "id": 21,
      "name": "La quinta ola",
      "description": "Los embates de cuatro olas crecientemente mortales destruyeron la mayor parte de la Tierra. En un ambiente de miedo y desconfianza, Cassie debe huir en un intento desesperado por salvar a su hermano menor. Mientras se prepara para la inevitable y letal quinta ola, Cassie hace equipo con un joven que podría convertirse en su última esperanza, si logra confiar en él.",
      "genres": "Accion | Aventura | Ciencia Ficcion",
      "genrecode": "G11000100000000000",
      "year": "2016",
      "duration": "112",
      "director": "J Blakeson",
      "cast": "Bailey Anne Borders, Chloë Grace Moretz, Gabriela Lopez, Matthew Zuk",
      "imgroute": "21.jpg",
      "rank": null
    },
    {
      "id": 22,
      "name": "Carol",
      "description": "Nueva York, años 50. Therese Belivet es una joven empleada de una tienda de Manhattan que sueña con una vida mejor cuando un día conoce  Carol Aird, una mujer elegante y sofisticada que se encuentra  atrapada en un matrimonio infeliz. Entre ellas surge una conexión  inmediata que irá haciéndose más intensa y profunda, cambiando la  vida de ambas para siempre.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "118",
      "director": "Todd Haynes",
      "cast": "Cate Blanchett, Jake Lacy, Kyle Chandler, Rooney Mara",
      "imgroute": "22.jpg",
      "rank": null
    },
    {
      "id": 23,
      "name": "Blue Mountain",
      "description": "The Rise of Thadland relata que luego de que had se gradúa y entra en la NFL, el quarterback Alex debe guiar a su equipo y luchar para salvar su casa de ser cerrada por el rector de la universidad.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2016",
      "duration": "90",
      "director": "Lev L. Spiro",
      "cast": "Alan Ritchson, Darin Brooks, James Cade, Rob Ramsay",
      "imgroute": "23.jpg",
      "rank": null
    },
    {
      "id": 24,
      "name": "La chica danesa",
      "description": "Basada en el libro de David Ebershoff, La Chica Danesa es una entrañable historia de amor, inspirada en la vida de Lili Elbey Gerda Wegener. El matrimonio y el trabajo de Lili y Gerda evolucionan a medida que recorren el innovador camino de Lili como mujer transgénero.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "119",
      "director": "Tom Hooper",
      "cast": "Adrian Schiller, Alicia Vikander, Eddie Redmayne, Tusse Silberg",
      "imgroute": "24.jpg",
      "rank": null
    },
    {
      "id": 25,
      "name": "Home Invasion",
      "description": "Una mujer rica y su hijastro quedan a merced de un trío de xpertos ladrones que irrumpen en su lujosa y apartada mansión a las afuera de la ciudad. A medida que la noche avanza, su única forma de posible ayuda proviene de una llamada con un especialista en sistemas de seguridad.",
      "genres": "Suspenso",
      "genrecode": "G00000000000001000",
      "year": "2016",
      "duration": "85",
      "director": "David Tennant",
      "cast": "Jason Patric, Liam Dickinson, Natasha Henstridge, Scott Adkins",
      "imgroute": "25.jpg",
      "rank": null
    },
    {
      "id": 26,
      "name": "Punto de quiebre",
      "description": "Un joven agente del FBI se infiltra en un extraordinario equipo de atletas de deportes extremos que él sospecha de ser la mente maestra en una serie de sofisticados atracos corporativos sin precedentes. Infiltrado y con su vida en peligro, se esforzará por probar que estos atletas son los artífices de los desconcertantes crímenes que están devastando a los mercados financieros de todo el mundo.",
      "genres": "Accion | Crimen",
      "genrecode": "G01000000000000001",
      "year": "2015",
      "duration": "114",
      "director": "Ericson Core",
      "cast": "Édgar Ramírez, Luke Bracey, Ray Winstone, Teresa Palmer",
      "imgroute": "26.jpg",
      "rank": null
    },
    {
      "id": 27,
      "name": "Secretos de una obsesión",
      "description": "Adaptación norteamericana de El secreto de sus ojos. En esta versión, un equipo de investigadores junto a la fiscal del distrito, se ven repentinamente destrozados cuando descubren que la hija adolescente de uno de ellos ha sido brutal e inexplicablemente asesinada. Trece años más tarde, descubren una pista que podría ayudarlos a resolver el caso y darle el cierre que tanto ansían. Pero nadie está preparado para el atroz e impactante secreto que saldrá a la luz.",
      "genres": "Misterio | Suspenso",
      "genrecode": "G00000000000001010",
      "year": "2015",
      "duration": "111",
      "director": "Billy Ray",
      "cast": "Chiwetel Ejiofor, Dean Norris, Julia Roberts, Nicole Kidman",
      "imgroute": "27.jpg",
      "rank": null
    },
    {
      "id": 28,
      "name": "Guerra de papás",
      "description": "Brad, un tranquilo ejecutivo de una estación de radio, lucha por convertirse en un gran padrastro para los pequeños hijos de su esposa. Las complicaciones comienzan cuando el desprendido y mantenido padre de los niños aparece en escena, forzando a Brad a competir por el afecto de los niños.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2015",
      "duration": "96",
      "director": "Sean Anders",
      "cast": "Linda Cardellini, Mark Wahlberg, Thomas Haden Church, Will Ferrell",
      "imgroute": "28.jpg",
      "rank": null
    },
    {
      "id": 29,
      "name": "Misconduct",
      "description": "Cuando un joven y ambicioso abogado acepta un caso contra un poderoso ejecutivo de una gran compañía farmacéutica, el joven letrado pronto se percata que está inmerso en un asunto mucho más complejo de lo que pensaba.",
      "genres": "Drama | Suspenso",
      "genrecode": "G00000001000001000",
      "year": "2016",
      "duration": "106",
      "director": "Shintaro Shimosawa",
      "cast": "Al Pacino, Alice Eve, Anthony Hopkins, Josh Duhamel",
      "imgroute": "29.jpg",
      "rank": null
    },
    {
      "id": 30,
      "name": "Grandma",
      "description": "Elle acaba de romper con su novia Olive, cuando su nieta Sage aparece inesperadamente pidiéndole dinero con urgencia. Aún dolida por su ruptura sentimental, la abuela Elle y Sage pasarán todo el día intentando conseguir dinero visitando a antiguos amigos, lo que hará que comiencen a desvelarse secretos del pasado.",
      "genres": "Drama | Comedia",
      "genrecode": "G00010001000000000",
      "year": "2015",
      "duration": "79",
      "director": "Paul Weitz",
      "cast": "Judy Greer, Julia Garner, Lily Tomlin, Marcia Gay Harden",
      "imgroute": "30.jpg",
      "rank": null
    },
    {
      "id": 31,
      "name": "Freaks of Nature",
      "description": "En Dillford (Ohio) hace tres días todo estaba tranquilo y se mantenía el estatus de siempre: los vampiros estaban en la parte superior del orden social, los zombis eran en la parte inferior, y los seres humanos se quedaban en el medio. Pero este delicado equilibrio se ve destrozado cuando el apocalipsis alienígena llega a Dillford y pone fin a toda la armonía. Ahora es el humano contra vampiros contra zombies, y todos ellos están en contra de los alienígenas. Corresponde a tres adolescentes —un humano, un vampiro y un zombie— que hacen equipo, y deben encontrar la manera de deshacerse de los visitantes interplanetarios, y tratar de restablecer el orden en esta pequeña ciudad “normal”.",
      "genres": "Comedia | Terror",
      "genrecode": "G00010000000100000",
      "year": "2015",
      "duration": "92",
      "director": "Robbie Pickering",
      "cast": "Denis Leary, Josh Fadem, Mackenzie Davis, Nicholas Braun",
      "imgroute": "31.jpg",
      "rank": null
    },
    {
      "id": 32,
      "name": "Jeruzalem",
      "description": "Cuando una pareja de adultos jóvenes estadounidenses vuelan a Israel para visitar la ciudad de Jerusalén, una pesadilla bíblica cae sobre la ciudad.",
      "genres": "Terror",
      "genrecode": "G00000000000100000",
      "year": "2015",
      "duration": "94",
      "director": "Doron Paz, Yoav Paz",
      "cast": "Danielle Jadelyn, Dibi Ben-Yosef, Yael Grobglas, Yon Tumarkin",
      "imgroute": "32.jpg",
      "rank": null
    },
    {
      "id": 33,
      "name": "Intruders",
      "description": "Anna sufre de agorafobia tan agobiante que cuando un trío de delincuentes irrumpen en su casa, ella no se atreve a huir. Pero lo que los intrusos no se dan cuenta es que la agorafobia no es su única psicosis.",
      "genres": "Drama | Suspenso |Terror",
      "genrecode": "G00000001000101000",
      "year": "2015",
      "duration": "90",
      "director": "Adam Schindler",
      "cast": "Jack Kesy, Leticia Jimenez, Rory Culkin, Timothy T. McKinney",
      "imgroute": "33.jpg",
      "rank": null
    },
    {
      "id": 34,
      "name": "Frente al mar",
      "description": "Sigue la historia de un escritor norteamericano llamado Roland y de su esposa, Vanessa, quienes llegan a un tranquilo y pintoresco hotel en la costa de Francia en la década de los 70, su matrimonio en aparente crisis. A medida que pasan tiempo con otros viajeros, incluidos los jóvenes recién casados Lea y François, y la gente del pueblo Michel y Patrice, la pareja comienza a ponerse de acuerdo con los problemas sin resolver en sus propias vidas.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "122",
      "director": "Angelina Jolie",
      "cast": "Angelina Jolie, Brad Pitt, Mélanie Laurent, Melvil Poupaud",
      "imgroute": "34.jpg",
      "rank": null
    },
    {
      "id": 35,
      "name": "Cider with Rosie",
      "description": "Esta basado en el libro de Laurie Lee, sidra con Rosie donde ella misma se describe como “una evocadora historia de mayoría de edad” y pasa el tiempo en un pueblo de Cotswald durante y después de la Primera Guerra Mundial. La joven Laurie Lee se convierte en un hombre, recordando su primer amor, la pérdida y la agitación familiar.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "90",
      "director": "Philippa Lowthorpe",
      "cast": "Georgie Smith, Samantha Morton, Teddie-Rose Malleson-Allen, Timothy Spall",
      "imgroute": "35.jpg",
      "rank": null
    },
    {
      "id": 36,
      "name": "Some Kind Of Beautiful",
      "description": "Richard Haign es un brillante profesor de Cambridge con una pasión desenfrenada por la poesía romántica y las mujeres hermosas. Sin embargo, la paternidad le cambiará la vida. De forma inesperada Kate, la joven estudiante americana que conoció en una de sus clases, le va a convertir en padre… noticia que recibe justo cuando conoce a Olivia, una novelista exuberante y excéntrica, hermana de la que pronto se convertirá en la madre de su hijo. Un trío amoroso que dista mucho de su ideal de familia.",
      "genres": "Comedia | Romance",
      "genrecode": "G00010000001000000",
      "year": "2014",
      "duration": "99",
      "director": "Tom Vaughan",
      "cast": "Jessica Alba, Malcolm McDowell, Pierce Brosnan, Salma Hayek",
      "imgroute": "36.jpg",
      "rank": null
    },
    {
      "id": 37,
      "name": "Navidad con los Cooper",
      "description": "Charlotte Cooper tiene un simple deseo navideño… que su familia tenga el recuerdo de una Navidad perfecta. Pero cuatro generaciones del clan Cooper, reunidos bajo el mismo techo está lejos de ser perfecto. Consuelo y alegría no vendrán fácilmente, caerán toneladas de nieve, la comida volará e invitados inesperados se unirán. Pero primero, los fantasmas de Navidades pasadas, presentes y futuras crearán sus marcas en la cabeza de cada uno de los Cooper en su regreso al hogar.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2015",
      "duration": "107",
      "director": "Jessie Nelson",
      "cast": "Alex Borstein, Diane Keaton, Ed Helms, John Goodman",
      "imgroute": "37.jpg",
      "rank": null
    },
    {
      "id": 38,
      "name": "Criminal Activities",
      "description": "Cuatro jóvenes hacen una arriesgada inversión que les mete en problemas con la mafia.",
      "genres": "Crimen | Drama | Suspenso",
      "genrecode": "G00000001000001001",
      "year": "2015",
      "duration": "94",
      "director": "Jackie Earle Haley",
      "cast": "Christopher Abbott, Dan Stevens, Michael Pitt, Rob Brown",
      "imgroute": "38.jpg",
      "rank": null
    },
    {
      "id": 39,
      "name": "Regresión",
      "description": "Minnesota, 1990. El detective Bruce Kenner (Ethan Hawke) investiga el caso de la joven Angela (Emma Watson), que acusa a su padre, John Gray (David Dencik), de cometer un crimen inconfesable. Cuando John, de forma inesperada y sin recordar lo sucedido, admite su culpa, el reconocido psicólogo Dr. Raines (David Thewlis) se incorpora al caso para ayudarle a revivir sus recuerdos reprimidos. Lo que descubren desenmascara una siniestra conspiración.",
      "genres": "Misterio | Suspenso | Terror",
      "genrecode": "G00000000000101010",
      "year": "2015",
      "duration": "106",
      "director": "Alejandro Amenábar",
      "cast": "David Thewlis, Devon Bostick, Emma Watson, Ethan Hawke",
      "imgroute": "39.jpg",
      "rank": null
    },
    {
      "id": 40,
      "name": "Macbeth",
      "description": "Cuenta la historia de un valiente guerrero y líder carismático que se ve abatido por la ambición y el deseo. Es una interpretación cautivante de las realidades dramáticas y una representación de lo que los tiempos de guerra habrán sido para uno de los personajes más famosos y atractivos de Shakespeare, una historia de pasión y ambición, ambientada en el paisaje escocés devastado por la guerra.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "113",
      "director": "Justin Kurzel",
      "cast": "Frank Madigan, Jack Madigan, Marion Cotillard, Michael Fassbender",
      "imgroute": "40.jpg",
      "rank": null
    },
    {
      "id": 41,
      "name": "Captive",
      "description": "Ashley Smith, una joven madre soltera que se está recuperando de su adicción a las drogas, es secuestrada en su propia casa por un hombre de color que huye de la justicia tras haber matado al juez asignado a su caso.",
      "genres": "Crimen | Drama | Suspenso",
      "genrecode": "G00000001000001001",
      "year": "2015",
      "duration": "97",
      "director": "Jerry Jameson",
      "cast": "Claudia Church, Elle Graham, Gina Stewart, Kate Mara",
      "imgroute": "41.jpg",
      "rank": null
    },
    {
      "id": 42,
      "name": "El último cazador de brujas",
      "description": "Centrada en la leyenda de una casta de cazadores de brujas. El último de ellos es Kaulder (Diesel), quien, dotado del don de la inmortalidad, sostiene la guerra entre seres humanos y las más horripilantes brujas de la historia",
      "genres": "Accion | Aventura | Fantasia",
      "genrecode": "G11000000100000000",
      "year": "2015",
      "duration": "106",
      "director": "Breck Eisner",
      "cast": "Elijah Wood, Ólafur Darri Ólafsson, Rose Leslie, Vin Diesel",
      "imgroute": "42.jpg",
      "rank": null
    },
    {
      "id": 43,
      "name": "Black Mass, Pacto criminal",
      "description": "En el sur del Boston de los setenta, el agente del FBI John Connolly (Edgerton) convence al Mafioso irlandés Jimmy Bulger (Depp) de colaborar con el FBI para eliminar a su enemigo en común: la mafia italiana. El drama narra la historia de esta profana alianza, que se sale de control vertiginosamente, permitiendo a Whitey evadir los cuerpos policiales, a medida que consolidaba su poder y se convertía en uno de los mafiosos más despiadados y peligrosos en la historia de Boston.",
      "genres": "Crimen | Drama",
      "genrecode": "G00000001000000001",
      "year": "2015",
      "duration": "122",
      "director": "Scott Cooper",
      "cast": "Benedict Cumberbatch, Dakota Johnson, Joel Edgerton, Johnny Depp",
      "imgroute": "43.jpg",
      "rank": null
    },
    {
      "id": 44,
      "name": "Suffragette",
      "description": "Sigue la historia de un grupo de mujeres que dieron los primeros pasos en el movimiento feminista contra un Estado que se presentaba cruel y las obligaba a actuar desde la clandestinidad.",
      "genres": "Drama ",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "106",
      "director": "Sarah Gavron",
      "cast": "Anne-Marie Duff, Carey Mulligan, Geoff Bell, Grace Stottor",
      "imgroute": "44.jpg",
      "rank": null
    },
    {
      "id": 45,
      "name": "Experta en crisis",
      "description": "Basada en el documental Our Brand Is Crisis, esta historia sigue a una mujer encargada de estrategia para campañas políticas en Estados Unidos que ahora deberá llevar su trabajo a un país de Latinoamérica.",
      "genres": "Drama | Comedia",
      "genrecode": "G00010001000000000",
      "year": "2015",
      "duration": "107",
      "director": "David Gordon Green",
      "cast": "Anthony Mackie, Billy Bob Thornton, Joaquim de Almeida, Sandra Bullock",
      "imgroute": "45.jpg",
      "rank": null
    },
    {
      "id": 46,
      "name": "De ahora y para siempre",
      "description": "La historia de amor de Laurel Hester (Julianne Moore) y Stacie Andrée (Ellen Page) y su lucha por la justicia. A la condecorada policía de Nueva Jersey Laurel le diagnostican cáncer y quiere dejar su pensión ganada durante años a su pareja de hecho, Stacie. Sin embargo, los legisladores del condado (Freeholders), que no ven con buenos ojos a la pareja gay, conspiran para evitarlo. El detective Dan Wells (Michael Shannon) y el activista Steven Goldstein (Steve Carrell) se suman a su defensa, reuniendo a oficiales de policía y ciudadanos de a pie para apoyar su lucha por la igualdad.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "106",
      "director": "Peter Sollett",
      "cast": "Ellen Page, Julianne Moore, Michael Shannon, Steve Carell",
      "imgroute": "46.jpg",
      "rank": null
    },
    {
      "id": 47,
      "name": "99 Homes",
      "description": "Un padre se esfuerza por recuperar la casa donde vivía con su familia, tras ser desahuciado. Para ello se pone a trabajar para el avaricioso hombre de negocios que fue el causante de su frustración.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2014",
      "duration": "112",
      "director": "Ramin Bahrani",
      "cast": "Andrew Garfield, Clancy Brown, Laura Dern, Michael Shannon",
      "imgroute": "47.jpg",
      "rank": null
    },
    {
      "id": 48,
      "name": "Fathers and Daughters",
      "description": "Tras la muerte de su mujer, un novelista que ha ganado el premio Pulitzer tendrá que hacerse cargo de la educación de su hija de cinco años.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "116",
      "director": "Gabriele Muccino",
      "cast": "Aaron Paul, Amanda Seyfried, Diane Kruger, Russell Crowe",
      "imgroute": "48.jpg",
      "rank": null
    },
    {
      "id": 49,
      "name": "Woodlawn",
      "description": "En el año 1973, un renacer espiritual consiguió que el entrenador y casi todos los jugadores de fútbol americano de un equipo de instituto, el Woodlawn, consiguieran superar sus diferencias de racismo y odio.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "123",
      "director": "GAndrew Erwin, Jon Erwin",
      "cast": "Caleb Castille, Nic Bishop, Sean Astin, Sherri Shepherd",
      "imgroute": "49.jpg",
      "rank": null
    },
    {
      "id": 50,
      "name": "Hombre irracional",
      "description": "En el campus de la universidad de un pequeño pueblo, un profesor de filosofía en plena crisis existencial le da un nuevo propósito a su vida cuando inicia una relación con una de sus estudiantes.",
      "genres": "Drama | Misterio",
      "genrecode": "G00000001000000010",
      "year": "2015",
      "duration": "95",
      "director": "Woody Allen",
      "cast": "Emma Stone, Joaquin Phoenix, Joe Stapleton, Nancy Carroll",
      "imgroute": "50.jpg",
      "rank": null
    },
    {
      "id": 51,
      "name": "Peter Pan",
      "description": "Peter, es un travieso y rebelde niño de 12 años. Pero en el sombrío orfanato de Londres donde vive esas cualidad no son aceptadas. En una increible noche, Peter es trasladado mágicamente a un mundo de piratas, hadas y guerreros llamado Nunca Jamás. Allí encuentra increibles aventuras, peleas de vida o muerte y grandes misterios. Formará equipo con la guerrera Tiger Lily y se hará amigo de James Hook y juntos se enfrentarán al despiadado pirata Barbanegra para salvar Nunca Jamás.",
      "genres": "Aventura | Fantasia",
      "genrecode": "G10000000100000000",
      "year": "2015",
      "duration": "111",
      "director": "Joe Wright",
      "cast": "Garrett Hedlund, Hugh Jackman, Levi Miller, Rooney Mara",
      "imgroute": "51.jpg",
      "rank": null
    },
    {
      "id": 52,
      "name": "Deadpool",
      "description": "Basado en el no convencional anti- héroe de Marvel Comics, Deadpool es la historia de un ex agente de las Fuerzas Especiales, Wade Wilson, que se volvió mercenario que luego de haber sido sometido a un experimento que lo deja con el poder de la curación acelerada, adopta el alter ego de Deadpool. Armado con sus nuevas habilidades y oscuro y retorcido sentido del humor, Deadpool persigue al hombre que casi destruyó su vida.",
      "genres": "Accion | Aventura | Comedia",
      "genrecode": "G11010000000000000",
      "year": "2016",
      "duration": "108",
      "director": "Tim Miller",
      "cast": "Ed Skrein, Karan Soni, Michael Benyaer, Ryan Reynolds.",
      "imgroute": "52.jpg",
      "rank": null
    },
    {
      "id": 53,
      "name": "El niño, The Boy",
      "description": "Una niñera se sorprende cuando su nuevo cliente no es más que un muñeco, al que sus ancianos padres cuidan con mucho recelo. Cuando ella rompe una de sus estrictas reglas, se desata una serie de eventos que le harán pensar que ese muñeco realmente está vivo.",
      "genres": "Suspenso | Terror",
      "genrecode": "G00000000000101000",
      "year": "2016",
      "duration": "97",
      "director": "William Brent Bell",
      "cast": "James Russell, Jim Norton, Lauren Cohan, Rupert Evans",
      "imgroute": "53.jpg",
      "rank": null
    },
    {
      "id": 54,
      "name": "Mi abuelo es un peligro",
      "description": "Justo antes de su casamiento, un joven bastante estricto es engañado para llevar a su abuelo, un pícaro exmilitar, a Florida durante el receso de primavera.",
      "genres": "Comedia",
      "genrecode": "G00010000000000000",
      "year": "2016",
      "duration": "102",
      "director": "Dan Mazer",
      "cast": "Aubrey Plaza, Robert De Niro, Zac Efron, Zoey Deutch",
      "imgroute": "54.jpg",
      "rank": null
    },
    {
      "id": 55,
      "name": "Colonia, Colonia dignidad",
      "description": "Durante el Golpe de Estado en Chile de 1973, grupos de personas salen a la calle a protestar contra el General Pinochet. En medio de la masa se encuentran Daniel y Lena, una joven pareja alemana, que como muchos otros son arrestrados por la policía secreta de Pinochet.",
      "genres": "Drama | Romance",
      "genrecode": "G00000001001000000",
      "year": "2015",
      "duration": "110",
      "director": "Florian Gallenberger",
      "cast": "Daniel Brühl, Emma Watson, Michael Nyqvist, Richenda Carey",
      "imgroute": "55.jpg",
      "rank": null
    },
    {
      "id": 56,
      "name": "The Driftless Area",
      "description": "Un camarero sin demasiados recursos económicos, vuelve a su ciudad natal después de que sus padres haya muerto. Allí se enamora de Stella (Zooey Deschanel, New Girl) una misteriosa mujer que le arrastrará a un peligroso destino enfrentado con Shane (John Hawkes, Lincoln), un peligroso criminal. Basado en el libro homónimo de Tom Drury.",
      "genres": "Comedia | Drama | Misterio",
      "genrecode": "G00001001000000010",
      "year": "2015",
      "duration": "95",
      "director": "Zachary Sluser",
      "cast": "Alia Shawkat, Anton Yelchin, John Hawkes, Zooey Deschanel.",
      "imgroute": "56.jpg",
      "rank": null
    },
    {
      "id": 57,
      "name": "Pandemic",
      "description": "En un futuro cercano, un virus de proporciones épicas se ha apoderado del planeta. Hay más personas infectadas que no infectadas, y la humanidad está perdiendo su control sobre la supervivencia. Su única esperanza es encontrar una cura y aislar a los infectados.",
      "genres": "Accion | Ciencia Ficcion |Suspenso",
      "genrecode": "G01000100000001000",
      "year": "2016",
      "duration": "91",
      "director": "John Suits",
      "cast": "Alfie Allen, Mekhi Phifer, Missi Pyle, Rachel Nichols.",
      "imgroute": "57.jpg",
      "rank": null
    },
    {
      "id": 58,
      "name": "Synchronicity",
      "description": "Cuando el físico Jim Beale inventa una máquina que puede doblar el espacio-tiempo, una rara dalia aparece desde el futuro. Ahora debe encontrar la coincidencia idéntica de la flor en el presente para demostrar que su máquina funciona. Jim pronto descubre que la dalia se encuentra en manos de una misteriosa mujer, que lo seduce para que revele sus secretos.",
      "genres": "Ciencia  Ficcion | Misterio | Suspenso",
      "genrecode": "G00000100000001010",
      "year": "2015",
      "duration": "110",
      "director": "Jacob Gentry",
      "cast": "AJ Bowen, Brianne Davis, Chad McKnight, Scott Poythress",
      "imgroute": "58.jpg",
      "rank": null
    },
    {
      "id": 59,
      "name": "La habitación",
      "description": "Cuenta la historia de Jack, un niño de 5 años lleno de energía que es cuidado por su amorosa mamá. Como cualquier buena madre, ella dedica su vida a mantener a Jack feliz y seguro, criándolo con calidez, amor y disfrutando de las típicas actividades como jugar y contarle historias. Sin embargo, su vida no es para nada típica: ellos viven atrapados. Están cautivos en un cuarto sin ventanas que mide 3 metros cuadrados, al que la mamá le llama la habitación. A medida de que la curiosidad de Jack crece acerca de la situación que vive y la resistencia de la mamá toca fondo, ellos comienzan a tramar un arriesgado plan para escapar que acabará enfrentándolos con su mayor miedo: el mundo real.",
      "genres": "Drama",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "118",
      "director": "Lenny Abrahamson",
      "cast": "Brie Larson, Jacob Tremblay, Sean Bridgers, Wendy Crewson",
      "imgroute": "59.jpg",
      "rank": null
    },
    {
      "id": 60,
      "name": "Creed",
      "description": "Adonis Johnson (Jordan) nunca conoció a su famoso padre, el campeón mundial de pesos pesados Apollo Creed, quien murió antes de que él naciera. Aún así, no se puede negar que lleva el boxeo en la sangre, por lo cual Adonis viaja a Filadelfia, el lugar donde se llevó a cabo su legendaria pelea con un duro principiante llamado Rocky Balboa. Una vez llegado a “la ciudad del amor fraternal”, Adonis va a buscar a Rocky (Stallone) y le pide que sea su entrenador. A pesar de insistir en que está retirado del mundo de las peleas, Rocky ve en Adonis la misma fuerza y determinación que Apollo, el feroz rival que terminó convirtiéndose en su amigo más cercano. Finalmente, Rocky acepta entrenar al joven luchador a pesar de estar él mismo contra un oponente mucho más letal que cualquiera al que se haya enfrentado en el ring. Con Rocky de su lado, no pasará mucho tiempo hasta que Adonis consiga su oportunidad de competir por un título, pero ¿podrá desarrollar no solo su impulso sino también el corazón de un verdadero luchador antes de entrar al ring?",
      "genres": "Drama ",
      "genrecode": "G00000001000000000",
      "year": "2015",
      "duration": "133",
      "director": "Ryan Coogler",
      "cast": "Michael B. Jordan, Phylicia Rashad, Sylvester Stallone, Tessa Thompson",
      "imgroute": "60.jpg",
      "rank": null
    },
    {
      "name": "test",
      "description": "asda",
      "genres": "| Animada | Thriller ",
      "genrecode": "G00100000000000100",
      "year": 2001,
      "duration": 120,
      "director": "asfsa",
      "cast": "asda",
      "imgroute": "newmovie.jpg",
      "rank": null,
      "id": 61
    }
  ],
  "users": [
    {
      "id": 1,
      "firstName": "Daniel",
      "lastName": "Llano Bermudez",
      "age": 22,
      "genre": "M",
      "preference": "Suspenso | Thriller | Misterio",
      "preferencecode": "G00000000000001110"
    },
    {
      "id": 2,
      "firstName": "Daniel",
      "lastName": "Vanegas",
      "age": 23,
      "genre": "M",
      "preference": "Accion | Comedia | Ciencia Ficcion | Documentales | Crimen | Drama | Thriller | Misterio",
      "preferencecode": "G01010111000000110"
    },
    {
      "id": 3,
      "firstName": "Angela Maria",
      "lastName": "Perez Zapata",
      "age": 21,
      "genre": "F",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Fantasia | Musicales |Suspenso | Thriller | Misterio ",
      "preferencecode": "G11110100110001110"
    },
    {
      "id": 4,
      "firstName": "Daniel",
      "lastName": "Alzate Ocampo",
      "age": 24,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Documentales | Suspenso | Thriller | Misterio | Crimen",
      "preferencecode": "G11110110000001111"
    },
    {
      "id": 5,
      "firstName": "Daniel",
      "lastName": "Diaz",
      "age": 19,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Documentales | Terror |  Thriller | Misterio | Crimen ",
      "preferencecode": "G11110110000100111"
    },
    {
      "id": 6,
      "firstName": "Andres Felipe",
      "lastName": "Alzate",
      "age": 22,
      "genre": "M",
      "preference": "Aventura | Accion | Comedia | Ciencia Ficcion | Documentales | Drama",
      "preferencecode": "G11010111000000000"
    },
    {
      "id": 7,
      "firstName": "Juan Camilo",
      "lastName": "Giraldo Berrio",
      "age": 18,
      "genre": "M",
      "preference": "Aventura | Accion | Ciencia Ficcion | Documentales | Drama| Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11000111000001111"
    },
    {
      "id": 8,
      "firstName": "Daniel Mauricio",
      "lastName": "Bueno Tapasco",
      "age": 25,
      "genre": "M",
      "preference": "Accion | Comedia | Documentales | Drama | Terror | Horror | Suspenso | Misterio",
      "preferencecode": "G01010011000111010"
    },
    {
      "id": 9,
      "firstName": "Paula Andrea",
      "lastName": "Rodriguez",
      "age": 28,
      "genre": "F",
      "preference": "Aventura | Accion | Animada | Comedia | Comedia Romantica | Ciencia Ficcion | Documentales | Drama | Fantasia | Musicales |Romance | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11111111111111111"
    },
    {
      "id": 10,
      "firstName": "Angela Maria",
      "lastName": "Perez Zapata",
      "age": 21,
      "genre": "F",
      "preference": "Aventura | Accion | Animada | Comedia | Comedia Romantica | Ciencia Ficcion | Documentales | Drama | Fantasia | Musicales |Romance | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G00000000000000000"
    },
    {
      "id": 11,
      "firstName": "Daniel",
      "lastName": "Barona Torres",
      "age": 19,
      "genre": "M",
      "preference": "Accion | Comedia| Ciencia Ficcion | Drama | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G01010101000111111"
    },
    {
      "id": 12,
      "firstName": "Mateo",
      "lastName": "Arias Davila",
      "age": 30,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Documentales | Drama | Fantasia | Musicales |Romance | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11010111100111111"
    },
    {
      "id": 13,
      "firstName": "Leandro",
      "lastName": "Herrera",
      "age": 23,
      "genre": "M",
      "preference": "Aventura | Accion | Ciencia Ficcion  | Fantasia | Terror | Horror | Suspenso | Crimen ",
      "preferencecode": "G11100100100111001"
    },
    {
      "id": 14,
      "firstName": "Juliana",
      "lastName": "Morales Marin",
      "age": 22,
      "genre": "F",
      "preference": "Accion | Animada | Comedia | Drama | Fantasia | Terror | Horror | Suspenso | Misterio | Crimen ",
      "preferencecode": "G01110001100111011"
    },
    {
      "id": 15,
      "firstName": "Luis",
      "lastName": "Lopez",
      "age": 35,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Fantasia | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11110100100111111"
    },
    {
      "id": 16,
      "firstName": "Andres Felipe",
      "lastName": "Ortiz Castañeda",
      "age": 26,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia |Comedia Romantica | Ciencia Ficcion | Documentales | Drama | Fantasia | Musicales | Romance | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11111111111111111"
    },
    {
      "id": 17,
      "firstName": "Jorge",
      "lastName": "Loaiza",
      "age": 20,
      "genre": "M",
      "preference": "Accion | Animada | Comedia  | Ciencia Ficcion | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G01110100000001111"
    },
    {
      "id": 18,
      "firstName": "Juan Esteban",
      "lastName": "Rivas Tamayo",
      "age": 18,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia | Ciencia Ficcion | Documentales | Terror | Horror | Suspenso | Thriller | Misterio | Crimen ",
      "preferencecode": "G11110110000111111"
    },
    {
      "id": 19,
      "firstName": "Asleyder",
      "lastName": "Ortiz Castañeda",
      "age": 26,
      "genre": "M",
      "preference": "Accion | Comedia | Ciencia Ficcion | Documentales | Drama | Musicales | Terror | Suspenso | Misterio | Crimen ",
      "preferencecode": "G01010111010101011"
    },
    {
      "id": 20,
      "firstName": "Daniela",
      "lastName": "Montoya Amaya",
      "age": 22,
      "genre": "F",
      "preference": "Animada | Comedia |Comedia Romantica | Drama | Fantasia | Musicales | Romance | Misterio ",
      "preferencecode": "G00111001111000010"
    },
    {
      "id": 21,
      "firstName": "Vladimir",
      "lastName": "Montes Betancurt",
      "age": 19,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Documentales | Drama | Fantasia | Terror | Horror | Misterio ",
      "preferencecode": "G11100011100110010"
    },
    {
      "id": 22,
      "firstName": "Alison",
      "lastName": "Reina Cabrera",
      "age": 18,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia |Comedia Romantica | Ciencia Ficcion | Drama | Romance | Terror | Horror | Suspenso | Misterio | Crimen ",
      "preferencecode": "G11111101001111011"
    },
    {
      "id": 23,
      "firstName": "Marylin",
      "lastName": "Vallejo",
      "age": 26,
      "genre": "M",
      "preference": "Aventura | Accion | Animada | Comedia |Comedia Romantica | Ciencia Ficcion | Drama | Fantasia | Terror | Suspenso | Thriller | Misterio ",
      "preferencecode": "G11111101100101110"
    },
    {
      "id": 24,
      "firstName": "Alejandra",
      "lastName": "Ospina",
      "age": 23,
      "genre": "M",
      "preference": "Aventura | Animada | Comedia | Documentales | Drama | Fantasia | Musicales | Romance | Terror | Horror | Suspenso | Thriller | Misterio",
      "preferencecode": "G10110011111111110"
    }
  ],
  "genres": [
    {
      "id": 1,
      "name": "Aventura"
    },
    {
      "id": 2,
      "name": "Acción"
    },
    {
      "id": 3,
      "name": "Animada"
    },
    {
      "id": 4,
      "name": "Comedia"
    },
    {
      "id": 5,
      "name": "Comedia Romántica"
    },
    {
      "id": 6,
      "name": "Ciencia Ficción"
    },
    {
      "id": 7,
      "name": "Documentales"
    },
    {
      "id": 8,
      "name": "Drama"
    },
    {
      "id": 9,
      "name": "Fantasía"
    },
    {
      "id": 10,
      "name": "Musicales"
    },
    {
      "id": 11,
      "name": "Romance"
    },
    {
      "id": 12,
      "name": "Terror"
    },
    {
      "id": 13,
      "name": "Horror"
    },
    {
      "id": 14,
      "name": "Suspenso"
    },
    {
      "id": 15,
      "name": "Thriller"
    },
    {
      "id": 16,
      "name": "Misterio"
    },
    {
      "id": 17,
      "name": "Crimen"
    }
  ]
}